Repository: artemanufrij/hashit
Catalog: po/*.po
Languages: ca, es, fr, nl

source: Calculating checksum…
ca: Calculant checksum…
es: Calculando checksum…
fr: Calcul de la somme de contrôle…
nl: Bezig met berekenen van controlesom…

source: Open a file
ca: Obrir un fitxer
es: Abrir un fichero
fr: Ouvrir un fichier
nl: Bestand openen

source: Choose an algorithm
ca: Escollir un algorisme
es: Escoger un algoritmo
fr: Choisir un algorithme
nl: Kies een algoritme

source: (optional) paste a reference hash here…
ca: (opcional) enganxar un hash de referència aquí…
es: (opcional) pegar un hash de referencia aquí…
fr: (facultatif) collez un hachage de référence ici…
nl: Plak een referentiehash hier (optioneel)…

source: Choose a file or drag one onto this window…
ca: Escollir un fitxer o arrosegar un en aquesta finestra…
es: Escoger un fichero o arrastrar uno a esta ventana
fr: Choisissez un fichier ou glissez-en un dans cette fenêtre…
nl: Kies een bestand of sleep een bestand hierheen…

source: Copy result…
ca: copiar resultat…
es: Copiar el resultado…
fr: Copier le résultat…
nl: Resultaat kopiëren…

source: Open
ca: Obrir
es: Abrir
fr: Ouvrir
nl: Openen

source: _Cancel
ca: _Cancel·lar
es: _Cancelar
fr: _Annuler
nl: _Annuleren

source: _Open
ca: _Obrir
es: _Abrir
fr: _Ouvrir
nl: _Openen

source: All files
ca: Tots els fitxers
es: Todos los ficheros
fr: Tous les fichiers
nl: Alle bestanden

source: Generate and verify file hashes
ca: Generar i verificar el hash del fitxer
es: Generar y verificar los hashes de fichero
fr: Génère et vérifie les hachages de fichiers
nl: Bestandshashes genereren en verifiëren

source: A tool that allows you to ensure a file hasn't become corrupted by comparing its hashsum
ca: Una ferramenta que et permet assegurar que un fitxer no està corrupte comparant el seu hashsum
es: Una herramienta que te permite asegurar que un fichero no está corrupto comparando su hashsum
fr: Un outil qui vous permet de vous assurer qu'un fichier n'a pas été corrompu en comparant sa somme de hachage.
nl: Een hulpmiddel dat je help vast te stellen dat een bestand niet corrupt is geraakt door het vergelijken van de controlesom

source: Verify files with a reference hash to ensure the integrity of files
ca: Verificar fixers amb un hash de referència per assegurar la integritat d'aquestos
es: Verificar ficheros con un hash de referencia para asegurar la integridad de los mismos
fr: Vérifie les fichiers avec un hachage de référence pour assurer l'intégrité des fichiers
nl: Verifieer bestanden met een referentiehash om de integriteit van je bestanden te verzekeren

source: Generate file hashes to allow yourself and others to verify file integrity
ca: Generar hashs de fitxers per permetre a tu i a altres comprovar la integritat d'un fitxer
es: Generar hashes de ficheros para permitirte a ti y a otros comprobar la integridad de un fichero
fr: Génère des hachages de fichiers pour vous permettre, à vous et aux autres, de vérifier l'intégrité des fichiers.
nl: Genereer bestandshashes om jezelf en anderen te verzekeren van integere bestanden

source: Supports SHA256, SHA1 and MD5 algorithms
ca: Suporta els algorismes SHA256, SHA1 i MD5
es: Soporta los algoritmos SHA256, SHA1 y MD5
fr: Supporte les algorithmes SHA256, SHA1 et MD5
nl: Ondersteunt de algoritmen SHA256, SHA1 en MD5

source: Update French (by NathanBnm)
fr: Mise à jour des traductions françaises (par NathanBnm)

source: New:
fr: Nouveau :

source: Switch to meson
fr: Passage à meson

source: Translation:
fr: Traduction :

source: Dutch (by Heimen Stoffels)
fr: Néérlandais (par Heimen Stoffels)

source: Lithuanian (by welaq)
fr: Lituanien (par welaq)

source: Norwegian Bokmål (by Harald H)
fr: Bokmål norvégien (par Harald H)

source: Improved:
fr: Amélioration :

source: Some descriptions (by aljelly)
fr: Quelques descriptions (par aljelly)

source: Fix:
fr: Correction :

source: ignore case insensitive for equal result and reference
fr: Ignore les majuscules et minuscules pour un résultat et une référence égaux

source: Polish (by DanyGee)
fr: Polonais (par DanyGee)

source: File choosing
fr: Choix des fichiers

source: Flat style
fr: Style Flat

source: Icon
fr: Icône

source: Czech (by Daniel Zvir)
fr: Tchèque (par Daniel Zvir)

source: hash;checksum;md5;sha256;
nl: hash;controlesom;md5;sha256;
